

var indonesia, y;





 




indonesia = {"customs":["You should respect local traditions, customs, laws and religions at all times and be aware of your actions to ensure that they do not offend other cultures or religious beliefs, especially during the holy month of Ramadan or if you intend to visit religious areas.",
						"You should be aware of offending Islamic sensitivities. ",
						"Police often raid venues (particularly in Bali) known to be frequented by foreigners.",
						"During Balinese New Year, known as Nyepi, local custom requires that all people in Bali observe a day of silence by staying indoors, turning off lights, and making no noise.",
						"if you are going to a temple, it’s often customary to cover yourself with something like a sarong.",
						"if you’re visiting destinations like Gili Trawangan, note that it’s disrespectful for women to show off too much skin, especially when walking around the village.",
						"Drink a lot of water to avoid getting heatstroke… just don’t get your water from the tap.",
						
                    ""
                   
				    ],
                    
					
					





					
					
			"laws":[	"Do not get involved with illegal drugs.",
						"Gambling is illegal in Indonesia.",
						"You must show evidence of your identity if it is requested by, for example, the Police. ",
						"It’s illegal to buy, sell, kill or capture any protected wild animal or trade its parts without a license. ",
						"A “smoke-free” bylaw went into effect across Bali in 2011; smoking is now forbidden in most public areas, including restaurants, hotels, temples, and tourist attractions.",
						"A section of Bali’s beach stretching from Kuta to Canggu is known to have rip tides and undertows. When the local authorities raise red flags on a beach, do not attempt to swim there."
					
                  ],
                  
                  
                  
                  
                  
            "gestures":["",
                    ""
                 
                  ]
         };
         


y = indonesia.laws;


var text = "";
for (i = 0; i < y.length; i++) { 
    text += y[i] + "<br>";
console.log(text);
}
document.getElementById("demo3").innerHTML = text;


y = indonesia.customs;
text = "";
for (i = 0; i < y.length; i++) { 
    text += y[i] + "<br>";
console.log(text);
}
document.getElementById("demo2").innerHTML = text;



y = indonesia.gestures;
text = "";
for (i = 0; i < y.length; i++) { 
    text += y[i] + "<br>";
console.log(text);
}
document.getElementById("demo4").innerHTML = text;
