



var spain, y;

spain = {"customs":["Lunchtime is usually between 13:00 – 15:30 and dinner is rarely served before 21:00.",
                    "Do not get involved in discussions about regionalism.",
                    "Do not call a Catalan Spanish.",
                    "Do not expect to see Flamenco everywhere.",
                    "Don’t expect to see a bullfight in Barcelona or the Canary Islands. ",
                    "Do not wander the city streets wearing only swimsuit.",
                    "Don’t wear the wrong things.",
                    "Don’t ignore local markets.",
                    "Don’t drink your hot chocolate.",
                    "Don’t pass the salt shaker from hand to hand. According to Spanish tradition, it brings bad luck.",
                    "Don’t plan anything important on Tuesday 13.",
                    ""
				    ],
                    
                    
                    
                    
                    
			"laws":["There’s a limit to the amount of dogs you can have with you at the same time. If there’s eight or more on your leashes, you’ll likely receive a penalty.",
                    "Do not wander the city streets wearing only swimsuit its illegal in seaside cities like Barcelona, Malaga, and Palma de Mallorca, where you can be punished with a €100 – €200 fine.",
                    "Seville law states that people cannot hang “indecent” clothes on a line. This obviously includes any underwear and suggestive attire.",
                    "Can’t Drive Wearing Sandals",
                    "there are some restrictions when it comes to naming children. For example, Mandarina is not acceptable because that is a fruit.",
                    "Palma de Mallorca now charges 600 pounds, or $820, for anybody that chooses to be topless in the city center.",
                    "Cadiz banned the common tradition of throwing rice after a wedding ceremony for a few reasons. One, some couples got injured by tripping on the rice, and they didn’t want birds flocking into the area.",
                    "Between the times of 3:29 PM and 6:47 PM, people cannot ask one another what time it is."
                  ],
                  
                  
                  
                  
                  
            "gestures":["Don’t pass the salt shaker from hand to hand. According to Spanish tradition, it brings bad luck.",
                    ""
                 
                  ]
         };
         


y = spain.laws;


var text = "";
for (i = 0; i < y.length; i++) { 
    text += y[i] + "<br>";
console.log(text);
}
document.getElementById("demo3").innerHTML = text;


y = spain.customs;
text = "";
for (i = 0; i < y.length; i++) { 
    text += y[i] + "<br>";
console.log(text);
}
document.getElementById("demo2").innerHTML = text;



y = spain.gestures;
text = "";
for (i = 0; i < y.length; i++) { 
    text += y[i] + "<br>";
console.log(text);
}
document.getElementById("demo4").innerHTML = text;

